# Disassemble Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyInstance..::..Disassemble Method
AssemblyInstance Class See Also
---
Removes the assembly instance and releases the member elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ICollection<ElementId> Disassemble()
```

Visual Basic
---
```text
Public Function Disassemble As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ Disassemble()
```

# ### Return Value
ids of elements previously under the assembly instance.
# See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace